# ElementsNeedToBeDisconnected Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..ElementsNeedToBeDisconnected Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
Elements need to be disconnected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementsNeedToBeDisconnected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementsNeedToBeDisconnected As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementsNeedToBeDisconnected {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace